{"pageProps":{"postData":{"id":"2015-12-16-notes-from-jbrains-workshop-in-milan-2015","c":"So I had a chance to follow a workshop by [JBrains](http://www.jbrains.ca)\nthanks to the company I work for, lastminute.com.\n\nHere you can find the notes I took during these two days.\n\nThe workshop was composed by programming sessions, Q&A sessions and TDD sessions\nwhere JBrains explained how to do Evolutionary Design\n(which is a really cool name for what I do every day, instead of TDD).\n\n*Here's my notes (contact me on twitter if you see any error):*\n\nAsk about the interface to the customer.\nExample: what happens if I don't find the bar-code?\n\nBook \"Getting things done!\".\n\nGet to the green bar as fast as you can.\nSpend as much time as possible in the\ngreen code-base. Write everything when\neverything is in the green bar.\n\nReduce the margin cost of adding a new feature.\nIf we \"don't clean the kitchen\" the margin cost\nwill go up like an exponential curve.\n\nOwnership of responsibility. Code without error\nis your responsibility as a programmer.\n\nUsage of primitive obsession: usage of simple\ntypes instead of complex objects.\n\nObjective of refactoring is to make the next\ntask easy.\n\nA feature is READY: somebody will be able to use this\n\nTesting steps:\n\n* Arrange (constructors, resources for the test)\n* Act (do the actual action)\n* Assert (check it's working)\n\nNot more than one action per test.\n\nTeams should not have different vision on code.\nIt's a problem otherwise: a failure is \"keeping the marriage together for the kids\".\n\nThe customer doesn't know how many details\nhe needs to give you. Try to get an approximate\nidea of what they want and then give back an implementation\nto get a quick feedback. A that point you can talk\ngiving examples on what they need.\n\nALWAYS ask to the customer.\n\nCheck for signs that the design is going out of control.\nExample: you test arithmetics checking strings.\n\nCheck for irrelevant lines, separate them and you\ncan see when you need to remove them from the class.\n\nThe link between the input and the expected output\nmust be clear.\n\nBook \"Chess: 5334 Problems, Combinations and Games\".\n\nThe only problems we have when dealing with client-server are\nthe ones about not respecting the contract.\nExample: I don't pass you \"null\".\n\nIn case of copy and paste code, use learning tests.\nIf I don't have control of the design I don't do TDD,\nI can write learning to test to understand the\ncontract.\n\nTest First programming to avoid mistakes!\n\nIf a test is difficult to write or we are testing something indirectly\nthen probably production code has problems.\n\nFind a community of people with more experience than you,\nthey can give you advice when you have doubts on your code.\n\nWith TDD you can learn module design.\n\nAgile works when you're willing to change the plan.\n\nBook \"The Goal\" about theory of constraints.\n\nThe 4 rules of simple design.\nA simple design means:\n\n1. <del>Passes its tests</del>\n2. Minimizes duplication\n3. Maximizes clarity\n4. <del>Has fewer elements</del>\n\nYou just need those 2.\n\nDeveloping strong skills on detecting duplication,\nremoving duplication, identifying naming problems,\nand fixing naming problems equates to learning\neverything ever written about object-oriented\ndesign.\n\n- Remove Duplication => Structure Emerges\n- Improve Names => Redistribute Responsibilities\n\nIf the name has \"if, then, but, or, and\" then\nsomething is wrong with the method. Also check for\nsomething like: *displayResult(String barcode)* is something\nthat should let you think because it tells you that inside\nyou are finding the price associated to the barcode and\nthen displaying it.\n\nThe single most important thing a human can do is\nabstraction. We need to treat a box like a single thing.\n\nImprove names -> Abstraction emerge ->\nHigher-level duplication -> remove duplication ->\nstructures emerge -> structures need names\n-> go to \"Improve names\" and start again.\n\nWhen it works STOP WRITING. Then go for removing\nduplication and liability.\n\nEgoless programming: <http://blog.codinghorror.com/the-ten-commandments-of-egoless-programming/>\n\nDon't use static because it's a strong dependency\nin your code.\n\nYou need to move your classes from test to\nproduction as soon someone needs it.\n\nIf you feel the need to format the code, just\nformat it then commit and then start working\notherwise diff will not be clear.\n\nWhen you see a typo made by another team\nmember count to 15 before telling him.\n\nMistake proof: build the system so that the\ncomponents goes in one place in one way (I think).\nPoka-yoke for more information: <https://en.wikipedia.org/wiki/Poka-yoke>\n\nProgramming by accident: move the things until\nthe things seems to work.\n\nCourse: \"Structure and Interpretation of\nComputer Programs\"\n\nTDD is a bad name. Test is actually an implementation of what we could call evolutionary design.\nTDD doesn't mean it's tested. It means I design using tests to control what I'm doing without the fear of losing features.\n","title":"Notes From JBrains Workshop in Milan 2015","date":"2015-12-16"}},"__N_SSG":true}