{"pageProps":{"postData":{"id":"2015-12-24-how-create-a-docker-image-and-publish-it-to-dockerhub","c":"This are my notes about how to configure a docker image and publish it on DockerHub.\nIt's just a condensed guide but you won't find anything new.\n\nAs you know [octopress][faef418d] is a ruby project with some peculiar dependency.\nI'm not a ruby developer so I would like not to have that many things on my pc used only for that purpose.\n\nNow, my intention is to use this image as a virtual machine where I can run octopress commands. And that's not\nhow you usually use a docker image. It's actually really different from the day to day usage but I'm not going\nto argue about the fact that I'm not using it in the proper way: you're right and Han shot first. That is not going\nto change the fact that we had Episodes 1 2 and 3 and the same goes for how I use docker in this case.\n\n(if you're wondering about the fact that all this ranting was to make a Star Wars reference: right again :P )\n\nWhen you create a new image you'll describe the way it's configured in a Dockerfile. Let's see mine:\n\n~~~~~~~~\nFROM debian:jessie\nMAINTAINER Emanuele Ianni <dierre@gmail.com>\n\nENV BUILD_PACKAGES bash libcurl4-openssl-dev git\nENV RUBY_PACKAGES ruby ruby-dev bundler\nENV EXECJS_DEPENDENCY nodejs\nENV GIT_URL https://github.com/octopress/octopress.git\n\n# Update and install all of the required packages.\n# At the end, remove the apk cache\nRUN apt-get update -y\nRUN apt-get upgrade -y\nRUN apt-get install -y $BUILD_PACKAGES\nRUN apt-get install -y $RUBY_PACKAGES\nRUN apt-get install -y $EXECJS_DEPENDENCY\nRUN rm -rf /var/cache/apk/*\n\n# cloning octopress repo and installing version\n\nRUN gem install --no-rdoc --no-ri pry-byebug\nRUN gem install --no-rdoc --no-ri octopress-ink\nRUN gem install --no-rdoc --no-ri clash\nRUN gem install --no-rdoc --no-ri octopress\nRUN mkdir octopress\nWORKDIR octopress\n~~~~~~~~\n\nYou can check official documentation to know how to use [docker build](https://docs.docker.com/engine/reference/commandline/build/) and what keys you can user in a [Dockerfile](https://docs.docker.com/engine/reference/builder/).\n\nWhat I would like to stress about it here is just keep it readable because configuring a docker image could be really complex. You can use `ENV` to set up environment variables that you can use later with `$VARIABLE`.\nRemember the difference between `RUN` and `CMD`. `RUN` is used with `docker build` whereas `CMD` is used when you use `docker run`.\n\nIn this particular case to build the image (that you can find on [DockerHub](https://hub.docker.com/r/invasionofsmallcubes/octopress/) ) just run `docker build -t octopress .`.\n\nTo run it is a little bit trickier than usual but it's doable: `docker run -p 4000:4000 -v /Users/dierre/Projects/octopress/:/octopress -i -t --entrypoint=\"/bin/bash\" invasionofsmallcubes/octropress`.\n\nHere you _expose_ the port 4000 that you will later use to check a preview of your blog, you'll start your docker image opening a console and then you share the content of your octopress repository that in my case is in _/Users/dierre/Projects/octopress/_.\n\nTo [tag](https://docs.docker.com/mac/step_six/) a built image you can just follow the official documentation, it's pretty straightforward.\n\nLast note: if you are using OSX then docker will start in a VirtualBox machine named _default_ which has a specific address. You you want to see a preview of the blog, remember to run `jekyll serve --host 0.0.0.0`, where the option `--host 0.0.0.0` is used to open jekyll to answer to every call from everywhere, because the default behaviour is just listen to 127.0.0.1 which is not a viable solution when using docker since you are using the host browser.\n\nI hope it's helpful.\n\n  [faef418d]: https://github.com/octopress/octopress \"Octopress Github Repository\"\n","title":"How to create an octopress docker image and publish it on DockerHub","date":"2015-12-24"}},"__N_SSG":true}